#include"goods.h"
#include <vector>



float weight[40] = { 1,2,3,2,5,2,3,4,5,8, 7,6,5,4,3,2,4,5,7,8, 9,8,7,6,5,3,3,2,5,6, 8,9,4,3,5,4,3,4,5,7 };
float price[40] = { 10,42,33,14,23,14,15,16,27,18,49,53,75,36,18,26,25,16,18,26,25,15,16,26,25,16,17,66,35,36,25,44,35,67,26,35,46,56,73,27 };

string good_names[40] = {
"Рыхлитель комб. A Combi3215-20",
"Секатор B/M 08904-35212 плоск.",
"Секатор B/S 08854-20212 плоск.",
"Секатор Classic 08754-30 лоск.",
"Секатор  ExpertCut 12203плоск.",
"Черенок алюм. Combi 0320 130см",
"Черенок алюм. Combi 0-20 150см",
"Черенок дерев. Combi -20 150см",
"Набор д/чистки дымохода нейлон",
"Набор д/чистки дымохода щетка)",
"Секатор GRINDA 8-423291_z Мини",
"Кусторез VERTO волновая 15G310",
"Кусторез VERTO 15G311 волновая",
"Мотыжка комб. руч VERTO 15G409",
"Мотыжка комб. VERTO 15G4121210",
"Пила садовая VERTO 15G100 скла",
"Рыхлитель VERTO 15G408 dsawsds",
"Секатор VERTO 15G200 плос 10мм",
"Секатор VERTO 15G201 конт 10мм",
"Секатор VERTO 15G202 плоx 12мм",
"Корнеудалитель PALISAD Stand86",
"Кусторез PALISAD 60562 50333мм",
"Кусторез PALISAD 60836 волн. 5",
"Кусторез PALISAD 608375 дерев.",
"Лопата д/снега PALISAD 615745 ",
"Лопата д/снега PALISAD 615915 ",
"Лопата походная PALISAD 61428 ",
"Мотыжка PALISADStandard 623884",
"Мотыжка комб. Classic 62315545",
"Мотыжка комб. Era 62377swswsws",
"Мотыжка комб. Nylon 623945sss3",
"Мотыжка комб. Standard 62389qq",
"Набор инвентаря Era 62903 3пр.",
"Нож садовый PALISAD  79001ssaa",
"Ножницы газонные PALISAD 60573",
"Ножницы газонные PALISAD 60574",
"Ножницы газонные PALISAD 60830",
"Перчатки садовые ПЭ PALISAD(L)",
"Перчатки садовые ПЭ PALISAD(M)",
"Перчатки садовые ПЭ PALISAD(S)"
};

// инициализирует набор всех предметов 
std::list<Goods> init_goods(std::list<Goods> goods)
{
    //goods.resize(NUM_GOODS);

    

    for (auto i = 0; i < NUM_GOODS; i++)
    {
        Goods g;
        g.init(good_names[i], weight[i], price[i]);
        goods.push_back(g);
        //goods[i].init(good_names[i], weight[i], price[i]);
    }
    return goods;
}